; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p3---int100n150-m25---int100c200---s59---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level9 level9)
(sum level0 level14 level14)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level9 level10)
(sum level1 level14 level15)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level9 level11)
(sum level2 level14 level16)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level9 level12)
(sum level3 level14 level17)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level9 level13)
(sum level4 level14 level18)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level9 level14)
(sum level5 level14 level19)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level9 level15)
(sum level6 level14 level20)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level9 level16)
(sum level7 level14 level21)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level9 level17)
(sum level8 level14 level22)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level9 level18)
(sum level9 level14 level23)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level9 level19)
(sum level10 level14 level24)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level9 level20)
(sum level11 level14 level25)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level9 level21)
(sum level12 level14 level26)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level9 level22)
(sum level13 level14 level27)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level9 level23)
(sum level14 level14 level28)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level9 level24)
(sum level15 level14 level29)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level9 level25)
(sum level16 level14 level30)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level9 level26)
(sum level17 level14 level31)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level9 level27)
(sum level18 level14 level32)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level9 level28)
(sum level19 level14 level33)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level9 level29)
(sum level20 level14 level34)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level9 level30)
(sum level21 level14 level35)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level9 level31)
(sum level22 level14 level36)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level9 level32)
(sum level23 level14 level37)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level9 level33)
(sum level24 level14 level38)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level9 level34)
(sum level25 level14 level39)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level9 level35)
(sum level26 level14 level40)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level9 level36)
(sum level27 level14 level41)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level9 level37)
(sum level28 level14 level42)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level9 level38)
(sum level29 level14 level43)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level9 level39)
(sum level30 level14 level44)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level9 level40)
(sum level31 level14 level45)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level9 level41)
(sum level32 level14 level46)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level9 level42)
(sum level33 level14 level47)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level9 level43)
(sum level34 level14 level48)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level9 level44)
(sum level35 level14 level49)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level9 level45)
(sum level36 level14 level50)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level9 level46)
(sum level37 level14 level51)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level9 level47)
(sum level38 level14 level52)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level9 level48)
(sum level39 level14 level53)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level9 level49)
(sum level40 level14 level54)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level9 level50)
(sum level41 level14 level55)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level9 level51)
(sum level42 level14 level56)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level9 level52)
(sum level43 level14 level57)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level9 level53)
(sum level44 level14 level58)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level9 level54)
(sum level45 level14 level59)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level9 level55)
(sum level46 level14 level60)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level9 level56)
(sum level47 level14 level61)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level9 level57)
(sum level48 level14 level62)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level9 level58)
(sum level49 level14 level63)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level9 level59)
(sum level50 level14 level64)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level9 level60)
(sum level51 level14 level65)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level9 level61)
(sum level52 level14 level66)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level9 level62)
(sum level53 level14 level67)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level9 level63)
(sum level54 level14 level68)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level9 level64)
(sum level55 level14 level69)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level9 level65)
(sum level56 level14 level70)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level9 level66)
(sum level57 level14 level71)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level9 level67)
(sum level58 level14 level72)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level59 level9 level68)
(sum level59 level14 level73)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level5 level65)
(sum level60 level9 level69)
(sum level60 level14 level74)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level5 level66)
(sum level61 level9 level70)
(sum level61 level14 level75)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level5 level67)
(sum level62 level9 level71)
(sum level62 level14 level76)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level5 level68)
(sum level63 level9 level72)
(sum level63 level14 level77)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level5 level69)
(sum level64 level9 level73)
(sum level64 level14 level78)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level5 level70)
(sum level65 level9 level74)
(sum level65 level14 level79)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level5 level71)
(sum level66 level9 level75)
(sum level66 level14 level80)
(sum level66 level25 level91)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level5 level72)
(sum level67 level9 level76)
(sum level67 level14 level81)
(sum level67 level25 level92)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level5 level73)
(sum level68 level9 level77)
(sum level68 level14 level82)
(sum level68 level25 level93)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level5 level74)
(sum level69 level9 level78)
(sum level69 level14 level83)
(sum level69 level25 level94)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level5 level75)
(sum level70 level9 level79)
(sum level70 level14 level84)
(sum level70 level25 level95)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level5 level76)
(sum level71 level9 level80)
(sum level71 level14 level85)
(sum level71 level25 level96)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level5 level77)
(sum level72 level9 level81)
(sum level72 level14 level86)
(sum level72 level25 level97)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level5 level78)
(sum level73 level9 level82)
(sum level73 level14 level87)
(sum level73 level25 level98)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level5 level79)
(sum level74 level9 level83)
(sum level74 level14 level88)
(sum level74 level25 level99)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level5 level80)
(sum level75 level9 level84)
(sum level75 level14 level89)
(sum level75 level25 level100)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level5 level81)
(sum level76 level9 level85)
(sum level76 level14 level90)
(sum level76 level25 level101)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level5 level82)
(sum level77 level9 level86)
(sum level77 level14 level91)
(sum level77 level25 level102)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level78 level5 level83)
(sum level78 level9 level87)
(sum level78 level14 level92)
(sum level78 level25 level103)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level79 level5 level84)
(sum level79 level9 level88)
(sum level79 level14 level93)
(sum level79 level25 level104)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level80 level5 level85)
(sum level80 level9 level89)
(sum level80 level14 level94)
(sum level80 level25 level105)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level81 level5 level86)
(sum level81 level9 level90)
(sum level81 level14 level95)
(sum level81 level25 level106)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level82 level5 level87)
(sum level82 level9 level91)
(sum level82 level14 level96)
(sum level82 level25 level107)
(sum level83 level1 level84)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level83 level5 level88)
(sum level83 level9 level92)
(sum level83 level14 level97)
(sum level83 level25 level108)
(sum level84 level1 level85)
(sum level84 level2 level86)
(sum level84 level3 level87)
(sum level84 level5 level89)
(sum level84 level9 level93)
(sum level84 level14 level98)
(sum level84 level25 level109)
(sum level85 level1 level86)
(sum level85 level2 level87)
(sum level85 level3 level88)
(sum level85 level5 level90)
(sum level85 level9 level94)
(sum level85 level14 level99)
(sum level85 level25 level110)
(sum level86 level1 level87)
(sum level86 level2 level88)
(sum level86 level3 level89)
(sum level86 level5 level91)
(sum level86 level9 level95)
(sum level86 level14 level100)
(sum level86 level25 level111)
(sum level87 level1 level88)
(sum level87 level2 level89)
(sum level87 level3 level90)
(sum level87 level5 level92)
(sum level87 level9 level96)
(sum level87 level14 level101)
(sum level87 level25 level112)
(sum level88 level1 level89)
(sum level88 level2 level90)
(sum level88 level3 level91)
(sum level88 level5 level93)
(sum level88 level9 level97)
(sum level88 level14 level102)
(sum level88 level25 level113)
(sum level89 level1 level90)
(sum level89 level2 level91)
(sum level89 level3 level92)
(sum level89 level5 level94)
(sum level89 level9 level98)
(sum level89 level14 level103)
(sum level89 level25 level114)
(sum level90 level1 level91)
(sum level90 level2 level92)
(sum level90 level3 level93)
(sum level90 level5 level95)
(sum level90 level9 level99)
(sum level90 level14 level104)
(sum level90 level25 level115)
(sum level91 level1 level92)
(sum level91 level2 level93)
(sum level91 level3 level94)
(sum level91 level5 level96)
(sum level91 level9 level100)
(sum level91 level14 level105)
(sum level91 level25 level116)
(sum level92 level1 level93)
(sum level92 level2 level94)
(sum level92 level3 level95)
(sum level92 level5 level97)
(sum level92 level9 level101)
(sum level92 level14 level106)
(sum level92 level25 level117)
(sum level93 level1 level94)
(sum level93 level2 level95)
(sum level93 level3 level96)
(sum level93 level5 level98)
(sum level93 level9 level102)
(sum level93 level14 level107)
(sum level93 level25 level118)
(sum level94 level1 level95)
(sum level94 level2 level96)
(sum level94 level3 level97)
(sum level94 level5 level99)
(sum level94 level9 level103)
(sum level94 level14 level108)
(sum level94 level25 level119)
(sum level95 level1 level96)
(sum level95 level2 level97)
(sum level95 level3 level98)
(sum level95 level5 level100)
(sum level95 level9 level104)
(sum level95 level14 level109)
(sum level95 level25 level120)
(sum level96 level1 level97)
(sum level96 level2 level98)
(sum level96 level3 level99)
(sum level96 level5 level101)
(sum level96 level9 level105)
(sum level96 level14 level110)
(sum level96 level25 level121)
(sum level97 level1 level98)
(sum level97 level2 level99)
(sum level97 level3 level100)
(sum level97 level5 level102)
(sum level97 level9 level106)
(sum level97 level14 level111)
(sum level97 level25 level122)
(sum level98 level1 level99)
(sum level98 level2 level100)
(sum level98 level3 level101)
(sum level98 level5 level103)
(sum level98 level9 level107)
(sum level98 level14 level112)
(sum level98 level25 level123)
(sum level99 level1 level100)
(sum level99 level2 level101)
(sum level99 level3 level102)
(sum level99 level5 level104)
(sum level99 level9 level108)
(sum level99 level14 level113)
(sum level99 level25 level124)
(sum level100 level1 level101)
(sum level100 level2 level102)
(sum level100 level3 level103)
(sum level100 level5 level105)
(sum level100 level9 level109)
(sum level100 level14 level114)
(sum level100 level25 level125)
(sum level101 level1 level102)
(sum level101 level2 level103)
(sum level101 level3 level104)
(sum level101 level5 level106)
(sum level101 level9 level110)
(sum level101 level14 level115)
(sum level101 level25 level126)
(sum level102 level1 level103)
(sum level102 level2 level104)
(sum level102 level3 level105)
(sum level102 level5 level107)
(sum level102 level9 level111)
(sum level102 level14 level116)
(sum level102 level25 level127)
(sum level103 level1 level104)
(sum level103 level2 level105)
(sum level103 level3 level106)
(sum level103 level5 level108)
(sum level103 level9 level112)
(sum level103 level14 level117)
(sum level103 level25 level128)
(sum level104 level1 level105)
(sum level104 level2 level106)
(sum level104 level3 level107)
(sum level104 level5 level109)
(sum level104 level9 level113)
(sum level104 level14 level118)
(sum level104 level25 level129)
(sum level105 level1 level106)
(sum level105 level2 level107)
(sum level105 level3 level108)
(sum level105 level5 level110)
(sum level105 level9 level114)
(sum level105 level14 level119)
(sum level105 level25 level130)
(sum level106 level1 level107)
(sum level106 level2 level108)
(sum level106 level3 level109)
(sum level106 level5 level111)
(sum level106 level9 level115)
(sum level106 level14 level120)
(sum level107 level1 level108)
(sum level107 level2 level109)
(sum level107 level3 level110)
(sum level107 level5 level112)
(sum level107 level9 level116)
(sum level107 level14 level121)
(sum level108 level1 level109)
(sum level108 level2 level110)
(sum level108 level3 level111)
(sum level108 level5 level113)
(sum level108 level9 level117)
(sum level108 level14 level122)
(sum level109 level1 level110)
(sum level109 level2 level111)
(sum level109 level3 level112)
(sum level109 level5 level114)
(sum level109 level9 level118)
(sum level109 level14 level123)
(sum level110 level1 level111)
(sum level110 level2 level112)
(sum level110 level3 level113)
(sum level110 level5 level115)
(sum level110 level9 level119)
(sum level110 level14 level124)
(sum level111 level1 level112)
(sum level111 level2 level113)
(sum level111 level3 level114)
(sum level111 level5 level116)
(sum level111 level9 level120)
(sum level111 level14 level125)
(sum level112 level1 level113)
(sum level112 level2 level114)
(sum level112 level3 level115)
(sum level112 level5 level117)
(sum level112 level9 level121)
(sum level112 level14 level126)
(sum level113 level1 level114)
(sum level113 level2 level115)
(sum level113 level3 level116)
(sum level113 level5 level118)
(sum level113 level9 level122)
(sum level113 level14 level127)
(sum level114 level1 level115)
(sum level114 level2 level116)
(sum level114 level3 level117)
(sum level114 level5 level119)
(sum level114 level9 level123)
(sum level114 level14 level128)
(sum level115 level1 level116)
(sum level115 level2 level117)
(sum level115 level3 level118)
(sum level115 level5 level120)
(sum level115 level9 level124)
(sum level115 level14 level129)
(sum level116 level1 level117)
(sum level116 level2 level118)
(sum level116 level3 level119)
(sum level116 level5 level121)
(sum level116 level9 level125)
(sum level116 level14 level130)
(sum level117 level1 level118)
(sum level117 level2 level119)
(sum level117 level3 level120)
(sum level117 level5 level122)
(sum level117 level9 level126)
(sum level118 level1 level119)
(sum level118 level2 level120)
(sum level118 level3 level121)
(sum level118 level5 level123)
(sum level118 level9 level127)
(sum level119 level1 level120)
(sum level119 level2 level121)
(sum level119 level3 level122)
(sum level119 level5 level124)
(sum level119 level9 level128)
(sum level120 level1 level121)
(sum level120 level2 level122)
(sum level120 level3 level123)
(sum level120 level5 level125)
(sum level120 level9 level129)
(sum level121 level1 level122)
(sum level121 level2 level123)
(sum level121 level3 level124)
(sum level121 level5 level126)
(sum level121 level9 level130)
(sum level122 level1 level123)
(sum level122 level2 level124)
(sum level122 level3 level125)
(sum level122 level5 level127)
(sum level123 level1 level124)
(sum level123 level2 level125)
(sum level123 level3 level126)
(sum level123 level5 level128)
(sum level124 level1 level125)
(sum level124 level2 level126)
(sum level124 level3 level127)
(sum level124 level5 level129)
(sum level125 level1 level126)
(sum level125 level2 level127)
(sum level125 level3 level128)
(sum level125 level5 level130)
(sum level126 level1 level127)
(sum level126 level2 level128)
(sum level126 level3 level129)
(sum level127 level1 level128)
(sum level127 level2 level129)
(sum level127 level3 level130)
(sum level128 level1 level129)
(sum level128 level2 level130)
(sum level129 level1 level130)

(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l0 l3)
(fuelcost level9 l0 l3)
(connected l1 l3)
(fuelcost level25 l1 l3)
(connected l1 l4)
(fuelcost level14 l1 l4)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l5)
(fuelcost level2 l2 l5)
(connected l2 l6)
(fuelcost level5 l2 l6)
(connected l3 l0)
(fuelcost level9 l3 l0)
(connected l3 l1)
(fuelcost level25 l3 l1)
(connected l3 l4)
(fuelcost level5 l3 l4)
(connected l3 l5)
(fuelcost level25 l3 l5)
(connected l3 l6)
(fuelcost level9 l3 l6)
(connected l4 l1)
(fuelcost level14 l4 l1)
(connected l4 l3)
(fuelcost level5 l4 l3)
(connected l5 l2)
(fuelcost level2 l5 l2)
(connected l5 l3)
(fuelcost level25 l5 l3)
(connected l5 l6)
(fuelcost level3 l5 l6)
(connected l6 l2)
(fuelcost level5 l6 l2)
(connected l6 l3)
(fuelcost level9 l6 l3)
(connected l6 l5)
(fuelcost level3 l6 l5)

(at t0 l5)
(fuel t0 level130)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l5 l3 level105 level25 level130)
   deleted: (at t0 l5) (fuel t0 level130)
   added: (at t0 l3) (fuel t0 level105)
   goals met: 0 of 3
2. (drive t0 l3 l1 level80 level25 level105)
   deleted: (at t0 l3) (fuel t0 level105)
   added: (at t0 l1) (fuel t0 level80)
   goals met: 0 of 3
3. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 3
4. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 3
5. (drive t0 l1 l3 level55 level25 level80)
   deleted: (at t0 l1) (fuel t0 level80)
   added: (at t0 l3) (fuel t0 level55)
   goals met: 0 of 3
6. (drive t0 l3 l0 level46 level9 level55)
   deleted: (at t0 l3) (fuel t0 level55)
   added: (at t0 l0) (fuel t0 level46)
   goals met: 0 of 3
7. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 3
8. (drive t0 l0 l2 level45 level1 level46)
   deleted: (at t0 l0) (fuel t0 level46)
   added: (at t0 l2) (fuel t0 level45)
   goals met: 1 of 3
9. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 3
10. (drive t0 l2 l6 level40 level5 level45)
   deleted: (at t0 l2) (fuel t0 level45)
   added: (at t0 l6) (fuel t0 level40)
   goals met: 1 of 3
11. (unload p2 t0 l6)
   deleted: (in p2 t0)
   added: (at p2 l6)
   goals met: 2 of 3
12. (drive t0 l6 l3 level31 level9 level40)
   deleted: (at t0 l6) (fuel t0 level40)
   added: (at t0 l3) (fuel t0 level31)
   goals met: 2 of 3
13. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 3 of 3
